#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.keycloak_test.module.onestopauth.module.client_testprojectjunmin-2222-100.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=d6abef10-35c1-4e01-8a84-c295079aad82]
module.keycloak_test.module.onestopauth.module.client_test-3-08-10-2021-465.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=f34b44d6-25c2-4083-9e3f-4e2298ab5442]
module.keycloak_test.module.onestopauth.module.client_testprojectjunmin-2222-100.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=730143fc-7ad1-4d89-87ac-fbe43bd29ae3]
module.keycloak_test.module.onestopauth.module.client_jon-test-1-235.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=71fea1dd-088b-4229-beca-942e3b584708]
module.keycloak_test.module.onestopauth.module.client_test-3-08-10-2021-465.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=2bc87b90-1544-436a-bc43-dc37f3a6068b]
module.keycloak_test.module.onestopauth.module.client_test-3-08-10-2021-465.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=6e776ebb-5b9b-442e-9da5-afe794d0d05f]
module.keycloak_test.module.onestopauth.module.client_test-3-08-10-2021-465.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=49e70ae0-2b5b-426c-bda7-513bded33489]
module.keycloak_test.module.onestopauth.module.client_test-3-08-10-2021-465.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=4b514d83-b2f0-4fa6-8982-6916dd9b5074]
module.keycloak_test.module.onestopauth.module.client_test-3-08-10-2021-465.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=d27d28c5-7397-41d1-a0fc-47408d5661a2]
module.keycloak_test.module.onestopauth.module.client_jon-test-1-235.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=cbea4edb-dd3e-42e5-b050-a274d6b6fe04]
module.keycloak_test.module.onestopauth.module.client_jon-test-1-235.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=cf3cd2ae-a2fb-4c1b-8056-79059a5fbbd2]
module.keycloak_test.module.onestopauth.module.client_jon-test-1-235.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=f11c2030-4e36-44ca-87f6-98b74e7adc49]
module.keycloak_test.module.onestopauth.module.client_jon-test-1-235.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=aa153c2c-6175-47f4-9705-3dea60504274]
module.keycloak_test.module.onestopauth.module.client_jon-test-1-235.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=06881f5a-9a2a-446d-8330-ecc60c3a7c9d]
module.keycloak_test.module.onestopauth.module.client_test-project-1-663.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=f9b7aa3e-ffea-441a-8b64-81d594306636]
module.keycloak_test.module.onestopauth.module.client_test-project-1-663.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=8676d291-c808-4cbd-81fc-723d25113184]
module.keycloak_test.module.onestopauth.module.client_test-project-1-663.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=96324cf6-85e9-409d-8d2b-deb15aafa560]
module.keycloak_test.module.onestopauth.module.client_test-project-1-663.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=e2491a64-839d-4913-96ae-42a4accf758e]
module.keycloak_test.module.onestopauth.module.client_test-133.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=f2a2fb12-422f-4b4c-b5ff-34f14cbd625d]
module.keycloak_test.module.onestopauth.module.client_test-133.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=a6acba35-105c-436c-adbe-e84aadb2642c]
module.keycloak_test.module.onestopauth.module.client_test-133.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=00008b11-5f5a-49ae-a363-005a4c03fe85]
module.keycloak_test.module.onestopauth.module.client_test-133.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=956a3f2f-5e6d-4f83-aa15-2f22e226d9f3]
module.keycloak_test.module.onestopauth.module.client_test-133.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=4d120e83-a391-470d-a517-5ad8a2c04441]
module.keycloak_test.module.onestopauth.module.client_test-133.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=f1b20d23-2966-492a-819e-6f7890a7961f]
module.keycloak_test.module.onestopauth.module.client_test-project-1-663.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=59f71ef0-fe8e-4c8b-8b0d-4b03761fe41b]
module.keycloak_test.module.onestopauth.module.client_test-project-1-663.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=d80c8eea-41df-4b00-b858-cb5285589e2e]
module.keycloak_test.module.onestopauth.module.client_test-2-08-09-2021-332.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=b00afd3a-9b76-43ce-9e34-cfb05071c8f2]
module.keycloak_test.module.onestopauth.module.client_test-2-08-09-2021-332.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=e4ad53bd-0fb8-42ca-bd95-3d5d0cbb1b23]
module.keycloak_test.module.onestopauth.module.client_test-2-08-09-2021-332.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=5453fa64-0eb4-43b1-8304-3efdad04aac0]
module.keycloak_test.module.onestopauth.module.client_test-2-08-09-2021-332.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=d5c93604-e0e3-4740-9584-84b066ab9120]
module.keycloak_prod.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=362d976c-2820-4f0f-a373-c520c3478342]
module.keycloak_prod.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=2ba29669-a2be-43c4-9e73-13c9b066ff39]
module.keycloak_test.module.onestopauth.module.client_test-2-08-09-2021-332.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=bf745114-72b7-4eef-a6b7-1280ac5330e2]
module.keycloak_test.module.onestopauth.module.client_test-2-08-09-2021-332.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=60037fdc-5984-4338-a1d2-ab18d803f7dc]
module.keycloak_prod.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=bcee6b9e-fc99-436e-943e-69858a9502cd]
module.keycloak_prod.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=80124ac5-0cfb-4bdc-bb8c-bb064be97d64]
module.keycloak_prod.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=583832ff-31c6-44cc-ac45-92a613fbf55b]
module.keycloak_prod.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=c7c13561-3d76-4df9-8cde-4818654a47fa]
module.keycloak_test.module.onestopauth.module.client_test-7-28-2021-133.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=6f3fdb25-195a-469b-93aa-c59f47eaf3c5]
module.keycloak_test.module.onestopauth.module.client_test-7-28-2021-133.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=dca48610-5d98-4b53-889b-a397e932cb0f]
module.keycloak_test.module.onestopauth.module.client_test-7-28-2021-133.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=f2652350-2af4-42a6-bd34-5d728810eabc]
module.keycloak_test.module.onestopauth.module.client_test-7-28-2021-133.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=4f44e715-e095-4b31-85dc-e7da82c4a457]
module.keycloak_test.module.onestopauth.module.client_test-7-28-2021-133.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=708c2ebd-7026-4ae4-a874-1d1e7cb56c73]
module.keycloak_test.module.onestopauth.module.client_test-7-28-2021-133.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=9014021e-84a5-4c3a-9e44-12421dd62d16]
module.keycloak_prod.module.onestopauth.module.client_test-email-notification-598.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=ca7dec40-8a3d-4d12-8778-2e5ee1d2da31]
module.keycloak_prod.module.onestopauth.module.client_test-email-notification-598.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=6282f1b9-e1a3-4944-a309-71bc7506e4b2]
module.keycloak_prod.module.onestopauth.module.client_test-email-notification-598.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=ef729f29-c171-4a24-b577-9afcf1698904]
module.keycloak_prod.module.onestopauth.module.client_test-email-notification-598.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=bb2929ff-738b-407e-8717-c13cdb5d6df4]
module.keycloak_prod.module.onestopauth.module.client_test-email-notification-598.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=aa1c58fe-b390-45a2-8b80-8a547f5e1ac1]
module.keycloak_prod.module.onestopauth.module.client_test-email-notification-598.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=af8edbe9-cd7e-45bb-a277-0047cef330a1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth.module.client_test-1061.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_test-1061.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_test-1061.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_test-1061.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "test-1061"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_test-1061.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_test-1061.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_test-1061.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "test-1061"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = true
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "test-1061"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://test",
        ]
      + web_origins                              = [
          + "+",
        ]
    }

  # module.keycloak_prod.module.onestopauth.module.client_test-1061.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_test-1061.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_test-1061.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_test-1061.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "test-1061"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_test-1061.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_test-1061.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_test-1061.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "test-1061"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = true
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "test-1061"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://test",
        ]
      + web_origins                              = [
          + "+",
        ]
    }

  # module.keycloak_test.module.onestopauth.module.client_test-1061.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_test-1061.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_test-1061.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_test-1061.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "test-1061"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_test-1061.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_test-1061.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_test-1061.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "test-1061"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = true
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "test-1061"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://test",
        ]
      + web_origins                              = [
          + "+",
        ]
    }

Plan: 21 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 1841 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*